In [2]:
import numpy as np
import pandas as pd

### serijos

In [5]:
data = [20, 30 ,40]
labels = ['x', 'y', 'z']
pd.Series(data, labels)

x    20
y    30
z    40
dtype: int64

In [7]:
data = [20, 30 ,40]
labels = ['x', 'y', 'z']
serija = pd.Series(data=data, index=labels)
serija

x    20
y    30
z    40
dtype: int64

In [8]:
zodynas = {'A': 1000, 'B':2000, 'C':999, 'D':10000}
pd.Series(zodynas)

A     1000
B     2000
C      999
D    10000
dtype: int64

In [9]:
serija = pd.Series([1, 2, 3, 4, 5], ['Vilnius', 'Kaunas', 'Klaipėda', 'Panevėžys', 'Šiauliai'])
serija

Vilnius      1
Kaunas       2
Klaipėda     3
Panevėžys    4
Šiauliai     5
dtype: int64

In [20]:
type(serija)

pandas.core.series.Series

In [10]:
serija['Vilnius']

1

In [11]:
type(serija['Vilnius'])

numpy.int64

In [13]:
serija2 = pd.Series([17, 2, 31, 40], ['Vilnius', 'Kaunas', 'Klaipėda', 'Alytus'])
serija2

Vilnius     17
Kaunas       2
Klaipėda    31
Alytus      40
dtype: int64

In [14]:
serija + serija2

Alytus        NaN
Kaunas        4.0
Klaipėda     34.0
Panevėžys     NaN
Vilnius      18.0
Šiauliai      NaN
dtype: float64

### DataFrames

In [16]:
df = pd.DataFrame(
    np.random.rand(5, 6), ["a", "b", "c", "d", "e"], ["U", "V", "W", "X", "Y", "Z"]
)

In [17]:
df

          U         V         W         X         Y         Z
a  0.789074  0.536261  0.688781  0.203664  0.905727  0.011575
b  0.525954  0.802894  0.214985  0.448667  0.421390  0.659663
c  0.940864  0.528567  0.937643  0.429230  0.419300  0.505545
d  0.621913  0.075018  0.218469  0.361307  0.466499  0.239112
e  0.781252  0.847808  0.910185  0.187813  0.150197  0.246432

In [18]:
df['U']

a    0.789074
b    0.525954
c    0.940864
d    0.621913
e    0.781252
Name: U, dtype: float64

In [21]:
df[['U']]

          U
a  0.789074
b  0.525954
c  0.940864
d  0.621913
e  0.781252

In [ ]:
df[['V', 'X', 'U']]

In [ ]:
df['naujas'] = [10, 45, 7, 10, 4] 
df

In [ ]:
df.drop('naujas', axis=1)

In [ ]:
df

In [ ]:
df.drop('naujas', axis=1, inplace=True)
df

In [ ]:
df.drop('a') # axis=0 default reikšmė

In [42]:
df

          U         V         W         X         Y         Z
a  0.789074  0.536261  0.688781  0.203664  0.905727  0.011575
b  0.525954  0.802894  0.214985  0.448667  0.421390  0.659663
c  0.940864  0.528567  0.937643  0.429230  0.419300  0.505545
d  0.621913  0.075018  0.218469  0.361307  0.466499  0.239112
e  0.781252  0.847808  0.910185  0.187813  0.150197  0.246432

In [ ]:
df.loc['a']

In [ ]:
df.loc[['a']]

In [ ]:
df.loc[['a', 'e']]

In [47]:
df.iloc[4]

U    0.781252
V    0.847808
W    0.910185
X    0.187813
Y    0.150197
Z    0.246432
Name: e, dtype: float64

In [48]:
df.iloc[[4]]

          U         V         W         X         Y         Z
e  0.781252  0.847808  0.910185  0.187813  0.150197  0.246432

In [50]:
df.loc["c", "Z"]

0.5055448682346523

In [51]:
df.loc[["a", "d"], ["Y", "Z", "X"]]

          Y         Z         X
a  0.905727  0.011575  0.203664
d  0.466499  0.239112  0.361307

In [52]:
df

          U         V         W         X         Y         Z
a  0.789074  0.536261  0.688781  0.203664  0.905727  0.011575
b  0.525954  0.802894  0.214985  0.448667  0.421390  0.659663
c  0.940864  0.528567  0.937643  0.429230  0.419300  0.505545
d  0.621913  0.075018  0.218469  0.361307  0.466499  0.239112
e  0.781252  0.847808  0.910185  0.187813  0.150197  0.246432

In [54]:
df[df>0.2]

          U         V         W         X         Y         Z
a  0.789074  0.536261  0.688781  0.203664  0.905727       NaN
b  0.525954  0.802894  0.214985  0.448667  0.421390  0.659663
c  0.940864  0.528567  0.937643  0.429230  0.419300  0.505545
d  0.621913       NaN  0.218469  0.361307  0.466499  0.239112
e  0.781252  0.847808  0.910185       NaN       NaN  0.246432

In [67]:
df[df['W']>0.3]

          U         V         W         X         Y         Z
a  0.789074  0.536261  0.688781  0.203664  0.905727  0.011575
c  0.940864  0.528567  0.937643  0.429230  0.419300  0.505545
e  0.781252  0.847808  0.910185  0.187813  0.150197  0.246432

In [66]:
df[['W']]

          W
a  0.688781
b  0.214985
c  0.937643
d  0.218469
e  0.910185

In [60]:
df[df["W"] > 0.3][["U", "W", "X"]]

          U         W         X
a  0.789074  0.688781  0.203664
c  0.940864  0.937643  0.429230
e  0.781252  0.910185  0.187813

In [62]:
df[(df["W"] > 0.3) & (df["Z"] > 0.1)][["U", "W", "X"]]

          U         W         X
c  0.940864  0.937643  0.429230
e  0.781252  0.910185  0.187813

In [68]:
df.reset_index()

  index         U         V         W         X         Y         Z
0     a  0.789074  0.536261  0.688781  0.203664  0.905727  0.011575
1     b  0.525954  0.802894  0.214985  0.448667  0.421390  0.659663
2     c  0.940864  0.528567  0.937643  0.429230  0.419300  0.505545
3     d  0.621913  0.075018  0.218469  0.361307  0.466499  0.239112
4     e  0.781252  0.847808  0.910185  0.187813  0.150197  0.246432

In [69]:
df

          U         V         W         X         Y         Z
a  0.789074  0.536261  0.688781  0.203664  0.905727  0.011575
b  0.525954  0.802894  0.214985  0.448667  0.421390  0.659663
c  0.940864  0.528567  0.937643  0.429230  0.419300  0.505545
d  0.621913  0.075018  0.218469  0.361307  0.466499  0.239112
e  0.781252  0.847808  0.910185  0.187813  0.150197  0.246432

In [70]:
naujas_index = ['Vilnius', 'Kaunas', 'Klaipėda', 'Panevėžys', 'Šiauliai']

In [71]:
df['Miestai'] = naujas_index

In [ ]:
df

In [75]:
df.set_index('Miestai', inplace=True)

In [ ]:
df